## 2. DataFrame

#### Create DataFrames

In [244]:
import numpy as np
import pandas as pd

In [245]:
### dataframe from lists; data manipulation
## list of name, degree, score in a course # https://www.geeksforgeeks.org/create-a-pandas-dataframe-from-lists/
name = ["Dakota", "Lucy", "Nathan", "Luke"]
program = ["MBA", "BIST", "MSIT", "MBA"]
score = [90, 88, 77, 99]
 
## lists ==> dictionary
dict = {'name': name, 'degree': program, 'score': score} 

## dictionary ==> dataframe
df = pd.DataFrame(dict)
df
# print(df)

     name degree  score
0  Dakota    MBA     90
1    Lucy   BIST     88
2  Nathan   MSIT     77
3    Luke    MBA     99

In [246]:
### array 
arr_2 = np.random.randint(10, 50, size = (2,3))
arr_2

array([[35, 24, 23],
       [25, 41, 36]])

In [247]:
### array ==> dataframe use DataFrame constructor
df_1 = pd.DataFrame(arr_2, ['A', 'B'], ['C', 'D', 'E'])
df_1

    C   D   E
A  35  24  23
B  25  41  36

In [248]:
dict_3 = {
    'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']), 
    'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd']),
         }
df_2 = pd.DataFrame(dict_3)
df_2
# print(df_2)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [249]:
### pd.DataFrame.from_dict() ==> dataframe
# pd.DataFrame.from_dict(dict([ ('A', [1,2,3]), ('B', [4,5,6]) ]), orient='index', columns=['one', 'two', 'three'])
# something = pd.DataFrame.from_dict(dict([ ('A', [1,2,3]), ('B', [4,5,6]) ]), orient='index', columns=['one', 'two', 'three'])

dict = { 'A': [1,2,3], 'B': [4, 5, 6]}
pd.DataFrame.from_dict(dict, orient='index', columns=['one', 'two', 'three'])

   one  two  three
A    1    2      3
B    4    5      6

In [250]:
### shape
df_1.shape

(2, 3)

#### Editing and Retrieving Data

In [251]:
df_1

    C   D   E
A  35  24  23
B  25  41  36

In [252]:
### retrieve data
print(df_1['C'], '\n')
print(df_1[[ 'C', 'E']], '\n')
print(df_1.loc['A'], '\n')
print(df_1.iloc[1], '\n')
print(df_1.loc['A', 'C'], '\n')
print(df_1.loc[['A', 'B'], ['C', 'D']])

A    35
B    25
Name: C, dtype: int64

    C   E
A  35  23
B  25  36

C    35
D    24
E    23
Name: A, dtype: int64

C    25
D    41
E    36
Name: B, dtype: int64

35

    C   D
A  35  24
B  25  41

In [253]:
### add column
df_1["Total"] = df_1['C'] + df_1['D'] + df_1['E']
df_1

    C   D   E  Total
A  35  24  23     82
B  25  41  36    102

In [254]:
df_2
df_2['mult'] = df_2['one'] * df_2['two']
df_2

   one  two  mult
a  1.0  1.0   1.0
b  2.0  2.0   4.0
c  3.0  3.0   9.0
d  NaN  4.0   NaN

In [264]:
dict_2 = {'C': 44, 'D': 45, 'E': 46}
new_row = pd.DataFrame(dict_2)
# df_1 = df_1.append(new_row)   ### append is deprecated in Pandas in 2.0
df_1 = pd.concat([df_1, new_row])

ValueError: If using all scalar values, you must pass an index

In [261]:
df_1

NameError: name 'df_1' is not defined

In [258]:
del df_1